snlkuharlocal/src/AccumulationRegisters/ТарныеОстатки/ТарныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТарныеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Профит/Профит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Профит</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклаутры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/ЛогиОстатковТМЦ/ЛогиОстатковТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогиОстатковТМЦ</name>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения1</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>допинф</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DelДатаИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/AccumulationRegisters/ТарныеОстатки/RecordSetModule.bsl
Процедура СформироватьДвиженияПоПрофиту() Экспорт
	Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда Возврат КонецЕсли;
	//крохин начало 10.04.2012
	//РНК-подарки формируют затраты, а не профит
	Если Отбор.Регистратор.Значение.Метаданные().Имя = "РасходнаяНакладная" И Отбор.Регистратор.Значение.Подарок Тогда
		Возврат;
	КонецЕсли; 
	//крохин конец 10.04.2012
	//крохин начало 08.12.2011
	//добавил рекламации (вычерки)
	//МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ");
	МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная");
	//крохин конец 08.12.2011
	
	Если НЕ МТ.СодержитТип(ТипЗнч(Отбор.Регистратор.Значение)) Тогда Возврат КонецЕсли; 
	
	Если ЗначениеЗаполнено(Отбор.Регистратор.Значение) Тогда
		Запрос=Новый Запрос;
		//крохин начало
		//ВозвратПоставщику формирует движения по затратам, а не профиту. С 01.07.2010
        Если Отбор.Регистратор.Значение.дата >= '20100701' Тогда
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Период,
		|	Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Подразделение,
		|	КодОперации,
		|	Отправитель КАК Контрагент,
		|	СУММА(Оборот)-СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ		
		|ГДЕ
		|	ОстаткиТМЦ.Регистратор = &Регистратор
	//	|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
	    |	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|СГРУППИРОВАТЬ ПО 
		|	Период,Номенклатура.Родитель.ВидНоменклатуры,Отправитель,Подразделение,КодОперации";
	Иначе
        		Запрос.Текст="
		|ВЫБРАТЬ
		|	Период,
		|	Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Подразделение,
		|	КодОперации,
		|	Отправитель КАК Контрагент,
		|	СУММА(Оборот)-СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ		
		|ГДЕ
		|	ОстаткиТМЦ.Регистратор = &Регистратор
		|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|СГРУППИРОВАТЬ ПО 
		|	Период,Номенклатура.Родитель.ВидНоменклатуры,Отправитель,Подразделение,КодОперации";

		КонецЕсли;
			    //крохин конец
		
		Запрос.УстановитьПараметр("Регистратор",Отбор.Регистратор.Значение);
		Выборка=Запрос.Выполнить().Выбрать();
		
		НЗ=РегистрыНакопления.Профит.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Отбор.Регистратор.Значение);
		
		Пока Выборка.Следующий() Цикл
			Запись=НЗ.Добавить();
			
			Запись.ВидДвижения=ВидДвиженияНакопления.Приход;			
			ЗаполнитьЗначенияСвойств(Запись,Выборка);		
		КонецЦикла;		
		
		НЗ.Записать();
	КонецЕсли;
КонецПроцедуры
 
Процедура ПриЗаписи(Отказ, Замещение)
	СформироватьДвиженияПоПрофиту();	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Если Отбор.Регистратор.Значение.Дата < ТекущаяДата() И НЕ ПараметрыСеанса.ОтключитьЖурнализациюЗаписи И ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		
		Запрос=Новый запрос;
		запрос.Текст="ВЫБРАТЬ
					 |	ЛогиОстатковТМЦ.Документ,
					 |	ЛогиОстатковТМЦ.ДатаИзменения1
					 |ИЗ
					 |	РегистрСведений.ЛогиОстатковТМЦ КАК ЛогиОстатковТМЦ
					 |ГДЕ
					 |	ЛогиОстатковТМЦ.Документ = &Документ
					 |	И КОНЕЦПЕРИОДА(ЛогиОстатковТМЦ.ДатаИзменения1, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаИзменения, ДЕНЬ)";
		
		Запрос.УстановитьПараметр("Документ", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("ДатаИзменения",ТекущаяДата());
			
		Выб=Запрос.Выполнить().Выбрать();
		Запись=РегистрыСведений.ЛогиОстатковТМЦ.СоздатьНаборЗаписей();
		Если выб.Следующий() тогда //Надо перезаписать
			Запись.Отбор.Документ.Установить(выб.документ.ссылка);
			Запись.Отбор.ДатаИзменения1.Установить(выб.ДатаИзменения1);
			Запись.Прочитать();
			Запись.Очистить();
			Запись.Записать();
		Конецесли;
		
		Запись=РегистрыСведений.ЛогиОстатковТМЦ.СоздатьМенеджерЗаписи();
	  	
		Если ЭтотОбъект.Количество()=0 тогда
			Запись.ДопИнф="Нули";
		Конецесли;
		
		Запись.ДатаИзменения1 = ТекущаяДата();
		Запись.Документ     =Отбор.Регистратор.Значение;
		Запись.Записать();
		
	КонецЕсли;
КонецПроцедуры
